<script setup lang="ts">
import { ref } from 'vue'
import { type CustomAttrs, VueMarkdown } from '@crazydos/vue-markdown'
import remarkToc from 'remark-toc'
import remarkGfm from 'remark-gfm'
import rehypeSlug from 'rehype-slug'

const markdown = ref(`
# РЕГЛАМЕНТ ОНЛАЙН-ТУРНИРА ПО ДИСЦИПЛИНЕ “OVERWATCH 2”
# “День защитника пейлоада” (МИКС-КАП)

**Версия документа:** 1.0
**Дата последнего обновления:** 20.01.2026

---

## ОГЛАВЛЕНИЕ

---

## 1. ОБЩИЕ ПОЛОЖЕНИЯ

### 1.1. Цели и сфера применения
#### 1.1.1. Настоящий Регламент (далее – Регламент) устанавливает официальные правила и условия проведения открытого онлайн-турнира по соревновательной дисциплине “Overwatch 2” на платформе PC.
#### 1.1.2. Регламент регулирует взаимоотношения между Организационным комитетом и Участниками, а также определяет порядок проведения соревнований.
#### 1.1.3. Участие в Турнире подразумевает безоговорочное согласие Участника со всеми пунктами настоящего Регламента.

### 1.2. Организационный комитет (Оргкомитет)
#### 1.2.1. Организаторам Турнира выступает стример [**xapu3maow**](https://www.twitch.tv/xapu3maow).
#### 1.2.2. Главным спонсором и инициатором Турнира является стример [**MistressBerry**](https://www.twitch.tv/mistressberry).
#### 1.2.3. Главным по организации и проведению Турнира является стример [**KelPerX7**](https://www.twitch.tv/KelPerX7).
#### 1.2.4. Оргкомитет несет ответственность за администрирование, судейство и принятие финальных решений по всем вопросам, связанным с проведением Турнира.

### 1.3. Внесение изменений в Регламент
#### 1.3.1. Оргкомитет оставляет за собой право вносить изменения и дополнения в настоящий Регламент в любое время до или во время проведения Турнира.
#### 1.3.2. Обо всех изменениях Участники будут уведомлены посредством официальных информационных каналов.

### 1.4. Коммуникационные каналы
#### 1.4.1. Основной платформой для коммуникации, регистрации, объявления результатов и экстренного оповещения является Discord-сервер (ссылка будет предоставлена).
#### 1.4.2. Связь с администрацией по общим вопросам осуществляется через специальный канал \`#вопрос-ответ-fc\` или личные сообщения **KelPerX7** (ЕдкийЕж).

---

## 2. УЧАСТИЕ И РЕГИСТРАЦИЯ

### 2.1. Требования к Участникам
#### 2.1.1. Быть платным подписчиком на Twitch-канал [**xapu3maow**](https://www.twitch.tv/xapu3maow). При отсутствии технической возможности её оформления принимается оплата путём перевода 150 рублей на DonationAlerts с указанием игрового ника или никнейма Twitch.
#### 2.1.2. К участию допускаются игроки, достигшие установленного минимального уровня квалификации:
1. **Игровое время:** Общее игровое время на аккаунте должно составлять не менее 100 часов в соревновательном режиме Overwatch 2.
2. **Калибровка:** Аккаунт должен иметь подтвержденную калибровку в соревновательном режиме не менее чем в трех соревновательных сезонах.
3. Аккаунт должен иметь 20 побед на основной роли в текущем сезоне.
4. Минимальный рейтинг для участия — **Платина 5**.
5. Для игроков, мало участвующих в других турнирах, обязательно указание 1 и более поручителей. Критерий известности игрока устанавливается только Оргкомитетом.

* *Известными считаются игроки, которые уже участвовали и были замечены на других турнирах.*
* *Игрок, которому самому нужен поручитель, не может быть поручителем для другого.*

#### 2.1.3. Калибровка аккаунта игрока для турнира:
* Участник обязан предоставить Btag аккаунта с наивысшим достигнутым рейтингом.
* Для целей верификации рейтинга, Участник обязан добавить в друзья Администратора: \`ЕдкийЕж#216878\`, обеспечив открытый доступ к профилю на период калибровки аккаунта.

#### 2.1.4. Оргкомитет оставляет за собой право отказать в допуске Участнику при обнаружении несоответствия предоставленных данных или наличии подозрительных оснований.
#### 2.1.5. Игрок должен сам отправить заявку администратору в Battle.net, администрация не несёт ответственность за это действие.
#### 2.1.6. Игрок, частично не удовлетворяющий требованиям, может попасть на турнир на усмотрение Оргкомитета.

### 2.2. Процедура регистрации и верификации
#### 2.2.1. Регистрация осуществляется посредством подачи официальной заявки с помощью специального сайта. Информация о нём появится позже в специальном Discord-канале.
#### 2.2.2. Срок окончания регистрации: **Четверг, 19.02.2026, 23:59 МСК**. Подача заявок после указанного срока помещает Участника в лист ожидания.
#### 2.2.3. **Чек-ин:** Все зарегистрированные Участники обязаны подтвердить свое присутствие в текстовом канале \`#подтверждение\` в установленное время: с 13:00 до 15:45 по МСК в день старта.

### 2.3. Формирование составов команд (Микс-кап)
#### 2.3.1. Турнир проводится в формате Микс-капа. Команды формируются Организационным комитетом на основании индивидуальных заявок Участников с использованием специальных инструментов балансировки.
#### 2.3.2. **Балансировка:** Формирование составов осуществляется с целью максимального усреднения рейтинга команд и создания наиболее равных команд.
#### 2.3.3. **Состав:** Каждая команда состоит из 5 (пяти) игроков.
#### 2.3.4. **Капитан:** Капитаном команды по умолчанию назначается игрок с наивысшим рейтингом в составе.
#### 2.3.5. **Окончательный состав:** Списков сформированных команд будет опубликован в день проведения турнира, после чек-ина.

---

## 3. СТРУКТУРА И ПОРЯДОК ПРОВЕДЕНИЯ ТУРНИРА

### 3.1. Сроки проведения
#### 3.1.1. **День 1 (Групповой этап/Плей-офф):**
Суббота, **21.02.2026**.
Начало: в 16:00 по МСК (Ориентировочное завершение: 22:00 МСК).

#### 3.1.2. **День 2 (Плей-офф):**
Воскресенье, **22.02.2026**.
Начало: 16:00 (Ориентировочное завершение: 22:00 МСК).

### 3.2. Формат турнирной сетки
#### 3.2.1. Турнир проводится в два этапа: Групповой (День 1) и Плей-офф (День 2).
#### 3.2.2. Система проведения: групповая **Swiss** и плей-офф **Double Elimination**.

### 3.3. Порядок проведения матчей
#### 3.3.1. Уведомление: Капитаны команд уведомляются о предстоящей встрече в специальном канале.
#### 3.3.2. Сбор в лобби: У команд есть 10 минут на сбор игроков в назначенном лобби. Неявка влечет за собой наложение санкция на игрока.

### 3.4. Создание и настройка лобби
#### 3.4.1. Создание: Лобби создает Капитан команды, стоящей выше по сетке.
#### 3.4.2. Код кастомки: \`5QHKB\`.
#### 3.4.3. Контроль настроек: Хост обязан следовать всем установленным настройкам. Любые несанкционированные изменения настроек игры или режимов влекут за собой дисквалификацию команды-хоста.

### 3.5. Использование пауз и рестарты
#### 3.5.1. Пауз: Команде разрешается использовать до трех (3) пауз на всю серию матча (Bo3/Bo5) продолжительностью не более 8 минут каждая.
#### 3.5.2. Основания: Технические неполадки или дисконнект игрока.
#### 3.5.3. Рестарт карты: Рестарт карты допускается только в случае критических технических сбоев лобби или обнаружения некорректных настроек до завершения времени на подготовку команд.
#### 3.5.4. В случае завершения матча в лобби с некорректными настройками, которые не давали явного преимущества одной из команд, он считается завершенным корректно и не подлежит переигровке.
#### 3.5.5. В случае, если прошло больше половины времени от матча и в лобби обнаруживаются некорректные настройки, не дающие явного преимущества, матч может быть перезапущен либо с согласия обоих капитанов, либо администратором, если он посчитает, что это необходимо.
#### 3.5.6. В случае, если прошло больше половины времени от матча и в лобби обнаруживаются некорректные настройки, не дающие явного преимущества, матч перезапускается при требовании хотя бы 1 из капитанов.

### 3.6. Система выбора карты
#### 3.6.1. Карточный пул: все карты соревновательного режима.
#### 3.6.2. Карты для каждого раунда выдаются Оргкомитетом и будут оглашены не позднее 16-го февраля.

### 3.7. Система банов героев
#### 3.7.1. Баны на каждой новой карте происходят заново.
#### 3.7.2. Первой запрещает героя команда, стоящая выше по сетке. Далее — вторая.
#### 3.7.3. Бан каждого конкретного героя может происходить каждой командой только один раз за встречу.

### 3.8. Замены игроков
#### 3.8.1. Если один из игроков не может продолжить участие в Турнире по каким-либо причинам, то Оргкомитетом производится его замена.
#### 3.8.2. Замена, предоставленная Оргкомитетом, будет максимально приближена к выбывшему игроку.
#### 3.8.3. Заменяющий игрок может быть по рангу ниже выбывшего, но никак не выше его.

---

## 4. ПРАВИЛА ИГРОВОГО ПРОЦЕССА

### 4.1. Правила проведения матчей (Свод правил)
#### 4.1.1. Все матчи проводятся в соревновательном режиме с отключенной функцией “Death Cam”.

### 4.2. Формат проведения турнира
#### 4.2.1. Групповой этап проходит в формате **BO2** (Best of Two – 2 матча независимо от результата, то есть допускается ничья 1-1). При ничьей на карте играется десайдер.
#### 4.2.2. Плей-офф (кроме финала) происходит в формате **BO3** (Best of Three – до двух побед).
#### 4.2.3. Финал проходит в формате **BO5** (Best of Five – до трёх побед).

---

## 5. ПОРЯДОК РАССМОТРЕНИЯ СПОРНЫХ СИТУАЦИЙ И ДИСЦИПЛИНАРНЫЕ МЕРЫ

### 5.1. Запрещенные действия
#### 5.1.1. Запрещено любое токсичное и неуважительное поведение, включая оскорбления оппонентов, тиммейтов или Администрации.
#### 5.1.2. Запрещено участие в матчах с использованием не зарегистрированного аккаунта или передача аккаунта третьим лицам.
#### 5.1.3. Запрещено использование читов, стороннего ПО, а также преднамеренное использование уязвимостей карт.

### 5.2. Система санкций и наказаний
#### 5.2.1. Отстранение игрока: За нарушение правил игрок отстраняется.
#### 5.2.2. Манипуляции рейтингом: За любые попытки намеренного завышения/занижения рейтинга (смурфинг) игрок дисквалифицируется и может быть помещён в чёрный список.

### 5.3. Разрешение споров
#### 5.3.1. По всем спорным моментам и конфликтным ситуациям следует обращаться к Организационному комитету для оперативного разрешения.
#### 5.3.2. В спорных ситуациях, не описанных данным Регламентом, Оргкомитет оставляет за собой право принять любые необходимые меры для обеспечения честного и бесперебойного течения соревнований.

---

## ПРИЛОЖЕНИЯ

### ПРИЛОЖЕНИЕ 1. Награды
Дополнительные награды: денежное вознаграждение:
* **25 000 рублей** — награда за первое место
* **10 000 рублей** — награда за второе место
* **5 000 рублей** — награда за третье место

Ответственным за выдачу приза является главный спонсор и инициатор проведения турнира — стример [**MistressBerry**](https://www.twitch.tv/mistressberry).
Администрация не несёт ответственность за выплату приза, если игрок указал неверные реквизиты.
Призы будут выданы не позднее 28-го февраля.

### ПРИЛОЖЕНИЕ 2. Трансляции
#### 2.1. Официальная трансляция ведется на Twitch-канале [**xapu3maow**](https://www.twitch.tv/xapu3maow).
#### 2.2. Сторонние трансляции разрешены, рекомендуется задержка не менее 90 секунд для избежания случаев стримснайпа.
`)

const customAttrs: CustomAttrs = {
  a: (node) => {
    if (
      typeof node.properties.href === 'string' &&
      !node.properties.href.startsWith(window.location.protocol + '//' + window.location.host) &&
      !node.properties.href.startsWith('#')
    ) {
      return { target: '_blank', rel: 'noopener noreferrer' }
    } else {
      return {}
    }
  },
}
</script>

<template>
  <article class="prose max-w-[60vw] prose-neutral dark:prose-invert mx-auto">
    <VueMarkdown
      :markdown="markdown"
      :customAttrs="customAttrs"
      :rehypePlugins="[rehypeSlug]"
      :remarkPlugins="[
        remarkGfm,
        [remarkToc, { maxDepth: 3, prefix: 'user-content-', heading: 'ОГЛАВЛЕНИЕ', tight: true }],
      ]"
      :sanitize="true"
    >
    </VueMarkdown>
  </article>
</template>

<style scoped></style>
